---
kind: property
id: P:Autodesk.Revit.DB.FilterOperatorAndTextString.FilterOperatorStr
source: html/94c01bfd-aba1-5e72-7ab2-c5bb2cbc8221.htm
---
# Autodesk.Revit.DB.FilterOperatorAndTextString.FilterOperatorStr Property

A text string denoting the filter operator.

## Syntax (C#)
```csharp
public string FilterOperatorStr { get; }
```